# Getting Started with Pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize = (10, 6))
np.set_printoptions(precision = 4)

In [3]:
%pwd

'/Users/wangshuailong/Data_Science/learn_data_science_the_hard_way/book/Python_for_Data_Analysis'

## Introduction to pandas data structures

### Series

In [4]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.values

array([ 4,  7, -5,  3])

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4, 7, -5, 3], index = ['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 10
obj2

d    10
b     7
a    -5
c     3
dtype: int64

In [11]:
obj2[['c', 'a', 'd']]

c     3
a    -5
d    10
dtype: int64

In [12]:
obj[obj > 2]

0    4
1    7
3    3
dtype: int64

In [13]:
obj2 * 2

d    20
b    14
a   -10
c     6
dtype: int64

In [14]:
np.exp(obj2)

d    22026.465795
b     1096.633158
a        0.006738
c       20.085537
dtype: float64

In [15]:
'b' in obj2

True

In [16]:
'e' in obj2

False

In [17]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [18]:
states = {'California', 'Ohio', 'Oregon', 'Texas'}
obj4 = Series(sdata, index = states)
obj4

Texas         71000.0
Oregon        16000.0
Ohio          35000.0
California        NaN
dtype: float64

In [19]:
pd.isnull(obj4)

Texas         False
Oregon        False
Ohio          False
California     True
dtype: bool

In [20]:
obj4.isnull()

Texas         False
Oregon        False
Ohio          False
California     True
dtype: bool

In [21]:
pd.notnull(obj4)

Texas          True
Oregon         True
Ohio           True
California    False
dtype: bool

In [22]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [23]:
obj4

Texas         71000.0
Oregon        16000.0
Ohio          35000.0
California        NaN
dtype: float64

In [24]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
Texas         71000.0
Oregon        16000.0
Ohio          35000.0
California        NaN
Name: population, dtype: float64

In [26]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [27]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Rfan']
obj

Bob      4
Steve    7
Jeff    -5
Rfan     3
dtype: int64

### DataFrame

In [28]:
data = {'state': ['Ohio', 'Ohio' ,'Ohio', 'Neveda', 'Neveda'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Neveda  2001
4  2.9  Neveda  2002

In [29]:
DataFrame(data, columns = ['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Neveda  2.4
4  2002  Neveda  2.9

In [30]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],
                   index = ['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Neveda  2.4  NaN
five   2002  Neveda  2.9  NaN

In [31]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [32]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
Name: state, dtype: object

In [33]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Neveda
five     Neveda
Name: state, dtype: object

In [34]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [35]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [36]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Neveda  2.4  16.5
five   2002  Neveda  2.9  16.5

In [37]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Neveda  2.4   3.0
five   2002  Neveda  2.9   4.0

In [38]:
val = Series([-1.2, -1.5, -1.7], index = ['two', 'four', 'five'])
val

two    -1.2
four   -1.5
five   -1.7
dtype: float64

In [39]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Neveda  2.4  -1.5
five   2002  Neveda  2.9  -1.7

In [45]:
frame2['eastern'] = frame2.state == 'Ohio'
frame2

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Neveda  2.4  -1.5   False
five   2002  Neveda  2.9  -1.7   False

In [46]:
del frame2['eastern']

In [47]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [48]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [49]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [50]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [51]:
DataFrame(pop, index = [2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [52]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [53]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [54]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [55]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

### Index object

In [56]:
obj5 = Series(range(3), index = ['a', 'b', 'c'])
obj5

a    0
b    1
c    2
dtype: int64

In [57]:
index = obj5.index
obj5

a    0
b    1
c    2
dtype: int64

In [58]:
index[1:]

Index(['b', 'c'], dtype='object')

In [59]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [60]:
index = pd.Index(np.arange(3))

In [61]:
obj6 = Series([1.5, -2.5, 0], index = index)

In [62]:
obj6.index is index

True

In [63]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [64]:
'Ohio' in frame3.columns

True

In [65]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [66]:
obj7 = Series(['4.5', '7.2', '-5.3', '3.6'], index = ['d', 'b', 'a', 'c'])
obj7

d     4.5
b     7.2
a    -5.3
c     3.6
dtype: object

In [67]:
obj8 = obj7.reindex(['a', 'b', 'c', 'd', 'e'])
obj8

a    -5.3
b     7.2
c     3.6
d     4.5
e     NaN
dtype: object

In [68]:
obj7.reindex(['a', 'b', 'c', 'd', 'e'], fill_value = 0)

a    -5.3
b     7.2
c     3.6
d     4.5
e       0
dtype: object

In [69]:
obj9 = Series(['blue', 'purple', 'yellow'], index = [0, 2, 4])
obj9

0      blue
2    purple
4    yellow
dtype: object

In [70]:
obj9.reindex(range(6), method = 'ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [71]:
frame4 = DataFrame(np.arange(9).reshape((3, 3)), index = ['a', 'c', 'd'],
                   columns = ['Ohio', 'Texas', 'California'])
frame4

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [72]:
frame5 = frame4.reindex(['a', 'b', 'c', 'd'])
frame5

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [73]:
states = ['Texas', 'Utah', 'California']
frame5.reindex(columns = states)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [74]:
frame4.reindex(index = ['a', 'b', 'c', 'd'], method = 'ffill', columns = states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [75]:
frame4.ix[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### Dropping entries from an axis

In [76]:
obj10 = Series(np.arange(5.0), index = ['a', 'b', 'c', 'd', 'e'])
obj10

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [77]:
obj11 = obj10.drop('c')
obj11

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [78]:
obj10.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [79]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [80]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [81]:
data.drop(['two'], axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [82]:
data.drop(['two', 'four'], axis = 1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### Indexing, selection, and filtering

In [83]:
obj11 = Series(np.arange(4.), index = ['a', 'b', 'c', 'd'])
obj11

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [84]:
obj11[1]

1.0

In [85]:
obj11['b']

1.0

In [86]:
obj11[2:4]

c    2.0
d    3.0
dtype: float64

In [87]:
obj11[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [88]:
obj11[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [89]:
obj11[obj11 < 2]

a    0.0
b    1.0
dtype: float64

In [90]:
obj11['b': 'd']

b    1.0
c    2.0
d    3.0
dtype: float64

In [91]:
obj11['b': 'c'] = 5
obj11

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [92]:
data = DataFrame(np.arange(16).reshape((4, 4,)), 
                 index = ['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns = ['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [93]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [95]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [96]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [97]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [99]:
data [data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [100]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [101]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [102]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [103]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [104]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [105]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### Arithmetic and data alignment

In [108]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [109]:
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [110]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [111]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [112]:
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [113]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### Arithmetic methods with fill values

In [114]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [115]:
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [116]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [117]:
df1.add(df2, fill_value = 0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [118]:
df1.reindex(columns = df2.columns, fill_value = 0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### Operations between DataFrame and Series

In [119]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [120]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [121]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [122]:
frame5 = DataFrame(np.arange(12.).reshape((4, 3)), columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregen'])
frame5

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregen  9.0  10.0  11.0

In [123]:
series5 = frame5.ix[0]
series5

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [124]:
frame5 - series5

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregen  9.0  9.0  9.0

In [125]:
series6 = Series(range(3), index = ['b', 'e', 'f'])
series6

b    0
e    1
f    2
dtype: int64

In [126]:
frame5 + series6

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregen  9.0 NaN  12.0 NaN

In [127]:
series7 = frame5['d']
series7

Utah       1.0
Ohio       4.0
Texas      7.0
Oregen    10.0
Name: d, dtype: float64

In [128]:
frame5

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregen  9.0  10.0  11.0

In [129]:
frame5.sub(series7, axis = 0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregen -1.0  0.0  1.0

### Function application and mapping

In [130]:
frame6 = DataFrame(np.random.randn(4, 3), columns = list('bde'),
                  index = ['Utah', 'Ohio', 'Texas', 'Oregen'])
frame6

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregen  1.246435  1.007189 -1.296221

In [131]:
np.abs(frame6)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregen  1.246435  1.007189  1.296221

In [132]:
f = lambda x: x.max() - x.min()

In [133]:
frame6.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [134]:
frame6.apply(f, axis = 1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregen    2.542656
dtype: float64

In [135]:
def f(x):
    return Series([x.max(), x.min()], index = ['min', 'max'])
frame6.apply(f)

            b         d         e
min  1.246435  1.965781  1.393406
max -0.555730  0.281746 -1.296221

In [136]:
frame6.apply(f, axis = 1)

             min       max
Utah    0.478943 -0.519439
Ohio    1.965781 -0.555730
Texas   0.769023  0.092908
Oregen  1.246435 -1.296221

In [137]:
format = lambda x: '%.2f' % x
frame6.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregen   1.25  1.01  -1.30

In [138]:
frame6['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregen    -1.30
Name: e, dtype: object

### Sorting and ranking

In [139]:
obj12 = Series(range(4), index = ['a', 'a', 'b', 'c'])
obj12

a    0
a    1
b    2
c    3
dtype: int64

In [140]:
obj12.sort_index()

a    0
a    1
b    2
c    3
dtype: int64

In [141]:
frame7 = DataFrame(np.arange(8).reshape((2, 4)), index = ['Three', 'one'],
                   columns = ['d', 'a', 'b', 'c'])
frame7

       d  a  b  c
Three  0  1  2  3
one    4  5  6  7

In [142]:
frame7.sort_index()

       d  a  b  c
Three  0  1  2  3
one    4  5  6  7

In [143]:
frame7.sort_index(axis = 1)

       a  b  c  d
Three  1  2  3  0
one    5  6  7  4

In [144]:
frame7.sort_index(axis = 1, ascending = False)

       d  c  b  a
Three  0  3  2  1
one    4  7  6  5

In [145]:
obj13 = Series([4, 7, -3, 2])
obj13

0    4
1    7
2   -3
3    2
dtype: int64

In [147]:
obj13.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [148]:
obj14 = Series([4, np.nan, 7, np.nan, -3, 2])
obj14

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [149]:
obj14.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [150]:
frame8 = DataFrame({'b': [4, 7, -3, 2],
                    'a': [0, 1, 0, 1]})
frame8

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [152]:
frame8.sort_values(by = 'b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [153]:
frame8.sort_values(by = ['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [154]:
obj15 = Series([7, -5, 7, 4, 2, 0, 4])
obj15

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [155]:
obj15.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [156]:
obj15.rank(method = 'first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [157]:
obj15.rank(ascending = False, method = 'max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [158]:
frame9 = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame9

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [159]:
frame9.rank(axis = 1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### Axis indexes with duplicate values

In [160]:
obj16 = Series(range(5), index = ['a', 'a', 'b', 'b', 'c'])
obj16

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [161]:
obj16.index.is_unique

False

In [162]:
obj16['a']

a    0
a    1
dtype: int64

In [163]:
obj16['c']

4

In [164]:
df3 = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df3

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [165]:
df3.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [166]:
df4 = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df4

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [167]:
df4.sum()

one    9.25
two   -5.80
dtype: float64

In [168]:
df4.sum(axis = 1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [169]:
df4.mean(axis = 1, skipna = False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [170]:
df4.idxmax()

one    b
two    d
dtype: object

In [171]:
df4.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [172]:
df4.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [173]:
obj17 = Series(['a', 'b', 'c', 'd'] * 4)
obj17

0     a
1     b
2     c
3     d
4     a
5     b
6     c
7     d
8     a
9     b
10    c
11    d
12    a
13    b
14    c
15    d
dtype: object

In [174]:
obj17.describe()

count     16
unique     4
top        c
freq       4
dtype: object

### Correlation and covariance

In [183]:
import pandas_datareader.data as web

In [185]:
import datetime
start = datetime.datetime(2000, 1, 1)
end = datetime.datetime(2010, 1, 1)

In [189]:
all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.DataReader(ticker, "yahoo", start, end)

In [199]:
price = DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [200]:
price.tail()

                 AAPL        GOOG         IBM       MSFT
Date
2009-12-24  27.655673  308.931613  113.748212  26.269973
2009-12-28  27.995679  311.124419  115.264033  26.414034
2009-12-29  27.663611  309.391155  114.863304  26.600466
2009-12-30  27.999648  311.054464  115.490545  26.236076
2009-12-31  27.879257  309.680858  114.035685  25.829315

In [201]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2009-12-24  0.034339  0.011117  0.004385  0.002587
2009-12-28  0.012294  0.007098  0.013326  0.005484
2009-12-29 -0.011861 -0.005571 -0.003477  0.007058
2009-12-30  0.012147  0.005376  0.005461 -0.013699
2009-12-31 -0.004300 -0.004416 -0.012597 -0.015504

In [202]:
returns.MSFT.corr(returns.IBM)

0.49597970053200341

In [204]:
returns.MSFT.cov(returns.IBM)

0.00021595764765417844

In [205]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.470676  0.410011  0.424305
GOOG  0.470676  1.000000  0.390689  0.443587
IBM   0.410011  0.390689  1.000000  0.495980
MSFT  0.424305  0.443587  0.495980  1.000000

In [206]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.001027  0.000303  0.000252  0.000309
GOOG  0.000303  0.000580  0.000142  0.000205
IBM   0.000252  0.000142  0.000367  0.000216
MSFT  0.000309  0.000205  0.000216  0.000516

In [207]:
returns.corrwith(returns.IBM)

AAPL    0.410011
GOOG    0.390689
IBM     1.000000
MSFT    0.495980
dtype: float64

In [208]:
returns.corrwith(volume)

AAPL   -0.057549
GOOG    0.062647
IBM    -0.007892
MSFT   -0.014245
dtype: float64

### Unique values, value counts, and membership

In [209]:
obj18 = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [210]:
uniques = obj18.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [211]:
obj18.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [212]:
pd.value_counts(obj18.values, sort = False)

b    2
a    3
d    1
c    3
dtype: int64

In [214]:
mask = obj18.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [215]:
obj18[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [216]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [217]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

### Handling missing data

In [218]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [219]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [220]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [221]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [222]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [223]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [224]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [225]:
cleaned = data.dropna()
cleaned

     0    1    2
0  1.0  6.5  3.0

In [226]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [227]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [228]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [229]:
df5 = DataFrame(np.random.randn(7, 3))
df5

          0         1         2
0 -0.577087  0.124121  0.302614
1  0.523772  0.000940  1.343810
2 -0.713544 -0.831154 -2.370232
3 -1.860761 -0.860757  0.560145
4 -1.265934  0.119827 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [230]:
df5.ix[:4, 1] = NA; df5.ix[:2, 2] = NA
df5

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [231]:
df5.dropna(thresh = 3)

          0         1         2
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [232]:
df5.dropna(thresh = 2)

          0         1         2
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data

In [233]:
df5.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [234]:
df5.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [235]:
df5.fillna({1: 0.5, 2: -1})

          0         1         2
0 -0.577087  0.500000 -1.000000
1  0.523772  0.500000 -1.000000
2 -0.713544  0.500000 -1.000000
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [236]:
# always return a reference to the filled object
_ = df5.fillna(0, inplace = True)
df5

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [238]:
df = DataFrame(np.random.randn(6, 3))

In [239]:
df

          0         1         2
0  0.670216  0.852965 -0.955869
1 -0.023493 -2.304234 -0.652469
2 -1.218302 -1.332610  1.074623
3  0.723642  0.690002  1.001543
4 -0.503087 -0.622274 -0.921169
5 -0.726213  0.222896  0.051316

In [240]:
df.ix[2: , 1] = NA

In [241]:
df.ix[4: , 2] = NA

In [242]:
df

          0         1         2
0  0.670216  0.852965 -0.955869
1 -0.023493 -2.304234 -0.652469
2 -1.218302       NaN  1.074623
3  0.723642       NaN  1.001543
4 -0.503087       NaN       NaN
5 -0.726213       NaN       NaN

In [243]:
df.fillna(method = 'ffill')

          0         1         2
0  0.670216  0.852965 -0.955869
1 -0.023493 -2.304234 -0.652469
2 -1.218302 -2.304234  1.074623
3  0.723642 -2.304234  1.001543
4 -0.503087 -2.304234  1.001543
5 -0.726213 -2.304234  1.001543

In [244]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0  0.670216  0.852965 -0.955869
1 -0.023493 -2.304234 -0.652469
2 -1.218302 -2.304234  1.074623
3  0.723642 -2.304234  1.001543
4 -0.503087       NaN  1.001543
5 -0.726213       NaN  1.001543

In [245]:
data = Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### Hierarchical indexing

In [246]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -1.157719
   2    0.816707
   3    0.433610
b  1    1.010737
   2    1.824875
   3   -0.997518
c  1    0.850591
   2   -0.131578
d  2    0.912414
   3    0.188211
dtype: float64

In [247]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [248]:
data['b']

1    1.010737
2    1.824875
3   -0.997518
dtype: float64

In [249]:
data['b': 'c']

b  1    1.010737
   2    1.824875
   3   -0.997518
c  1    0.850591
   2   -0.131578
dtype: float64

In [250]:
data.ix[['b', 'd']]

b  1    1.010737
   2    1.824875
   3   -0.997518
d  2    0.912414
   3    0.188211
dtype: float64

In [251]:
data[:, 2]

a    0.816707
b    1.824875
c   -0.131578
d    0.912414
dtype: float64

In [254]:
data['a', 1]

-1.1577194663127239

In [255]:
data.unstack()

          1         2         3
a -1.157719  0.816707  0.433610
b  1.010737  1.824875 -0.997518
c  0.850591 -0.131578       NaN
d       NaN  0.912414  0.188211

In [256]:
data.unstack().stack()

a  1   -1.157719
   2    0.816707
   3    0.433610
b  1    1.010737
   2    1.824875
   3   -0.997518
c  1    0.850591
   2   -0.131578
d  2    0.912414
   3    0.188211
dtype: float64

In [257]:
frame9 = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame9

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [258]:
frame9.index.names = ['key1', 'key2']
frame9.columns.names = ['state', 'color']
frame9

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [259]:
frame9['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### Reordering and sorting levels

In [260]:
frame9.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [261]:
frame9.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [262]:
frame9.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [263]:
frame9.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [264]:
frame9.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [265]:
frame10 = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame10

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [266]:
frame11 = frame10.set_index(['c', 'd'])
frame11

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [267]:
frame12 = frame10.set_index(['c', 'd'], drop = False)
frame12

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [268]:
frame11.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [269]:
ser = Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [270]:
ser.iloc[-1]
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [271]:
ser2 = Series(np.arange(3.), index = ['a', 'b', 'c'])
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [272]:
ser2[-1]

2.0

In [273]:
ser.ix[:1]

0    0.0
1    1.0
dtype: float64

In [274]:
ser3 = Series(range(3), index = [-5, 1, 3])
ser3

-5    0
 1    1
 3    2
dtype: int64

In [276]:
ser3.iloc[2]

2

In [277]:
ser3.iat[2]

2

In [278]:
frame12 = DataFrame(np.arange(6).reshape((3, 2)), index = [2, 0, 1])
frame12

   0  1
2  0  1
0  2  3
1  4  5

In [280]:
frame12.iloc[0]

0    0
1    1
Name: 2, dtype: int64

### Panel data

In [281]:
import pandas_datareader.data as web

In [282]:
pdata = pd.Panel(dict((stk, web.DataReader(stk, 'yahoo', start='1/1/2009', end='1/1/2010')) 
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [283]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 252 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2009-12-31 00:00:00
Minor_axis axis: Open to Adj Close

In [285]:
pdata = pdata.swapaxes('items', 'minor')

In [286]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  12.006086  10.39902  160.499779  16.833241
2009-01-05  12.512789  10.26359  163.861421  16.990562
2009-01-06  12.306404  10.68922  166.863420  17.189282
2009-01-07  12.040484  10.78596  160.844427  16.154282
2009-01-08  12.264068  10.90204  162.432840  16.659362
2009-01-09  11.983595  10.75694  157.377899  16.162562
2009-01-12  11.729582  10.30228  156.189080  16.121161
2009-01-13  11.603899  10.40869  157.003261  16.410961
2009-01-14  11.289028   9.97338  150.334921  15.806521
2009-01-15  11.031046  10.19587  149.345914  15.930721
2009-01-16  10.892133   9.93469  149.685575  16.319881
2009-01-20  10.345740   9.52840  141.234014  15.301441
2009-01-21  10.958282   9.86697  151.388865  16.046641
2009-01-22  11.689893   9.65416  153.097158  14.167082
2009-01-23  11.689893   9.80893  162.188089  14.241602
2009-01-26  11.859235   9.97338  161.773501  14.597641
2009-01-27  12.003440   9.74122  165.574702  14.622481
2009-01-28  12.462516  10.52477  174.161139  14.937122
2009-01-29  12.303758   9.62514  171.488809  14.564521
2009-01-30  11.924061   9.18983  169.096191  14.158801
2009-02-02  12.106633   9.00603  170.115172  14.763241
2009-02-03  12.301112   9.45101  170.055239  15.318001
2009-02-04  12.376522   9.47036  171.328962  15.425641
2009-02-05  12.761510   9.12212  176.683613  15.765122
2009-02-06  13.192803   9.15114  185.454867  16.278481
2009-02-09  13.561917   9.32526  189.196135  16.096322
2009-02-10  12.942760   8.86093  179.076231  15.566401
2009-02-11  12.809138   8.72550  178.841472  15.905881
2009-02-12  13.133269   8.87060  181.343964  15.947282
2009-02-13  13.118716   8.82224  178.661643  15.806521
...               ...       ...         ...        ...
2009-11-18  27.248193  15.53565  288.037456  25.515771
2009-11-19  26.527166  15.35185  286.209296  25.236123
2009-11-20  26.449110  13.82344  284.695781  25.100536
2009-11-23  27.237609  14.30711  290.884611  25.371710
2009-11-24  27.047100  13.85246  291.254246  25.346287
2009-11-25  27.014025  13.89115  292.577910  25.244598
2009-11-27  26.537750  13.67834  289.590906  24.761568
2009-11-30  26.447787  13.65899  291.209293  24.922578
2009-12-01  26.058829  13.38813  294.640874  25.431029
2009-12-02  25.960929  13.21401  293.462046  25.236123
2009-12-03  25.994003  13.02054  292.577910  25.278493
2009-12-04  25.575941  13.02054  292.213294  25.405606
2009-12-07  24.997796  12.85609  292.832667  25.244598
2009-12-08  25.119511  12.39176  293.232260  25.058164
2009-12-09  26.168637  12.68196  294.216280  25.176802
2009-12-10  25.987388  12.79805  295.455055  25.312391
2009-12-11  25.754543  12.69164  294.960537  25.295442
2009-12-14  26.060152  12.74871  297.567930  25.515771
2009-12-15  25.688394  13.06891  296.274225  25.439503
2009-12-16  25.802171  13.25270  298.581939  25.507297
2009-12-17  25.382784  13.29140  296.673849  25.083588
2009-12-18  25.855090  13.29140  297.912594  25.727626
2009-12-21  26.225525  13.64931  299.041480  25.863213
2009-12-22  26.507322  13.64931  300.260243  26.117438
2009-12-23  26.737522  13.87181  305.534978  26.202180
2009-12-24  27.655673  14.30711  308.931613  26.269973
2009-12-28  27.995679  14.12332  311.124419  26.414034
2009-12-29  27.663611  13.85246  309.391155  26.600466
2009-12-30  27.999648  14.30711  311.054464  26.236076
2009-12-31  27.879257  13.89115  309.680858  25.829315

[252 rows x 4 columns]

In [287]:
pdata.ix[:, '6/1/2009', :]

            Open        High         Low       Close       Volume   Adj Close
AAPL  136.469999  139.990000  136.000002  139.349998  113124900.0   18.435792
DELL   11.700000   12.250000   11.680000   12.180000   26080000.0   11.782330
GOOG  418.730711  429.600728  418.530715  426.560745    6669600.0  213.067305
MSFT   21.000000   21.500000   20.860001   21.400000   57317100.0   17.953996

In [289]:
pdata.ix['Adj Close', '5/22/2009':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2009-05-22  16.206563  10.49575  196.553786  16.569693
2009-05-26  17.301994  10.77628  201.978362  17.064686
2009-05-27  17.602312  10.75694  202.577767  16.888502
2009-05-28  17.869553  11.10518  204.995355  17.156974
2009-05-29  17.967455  11.19224  208.406954  17.526120
2009-06-01  18.435792  11.78233  213.067305  17.953996
2009-06-02  18.454314  11.55016  213.986388  17.953996
2009-06-03  18.647469  11.24061  215.609763  18.230857
2009-06-04  19.016583  11.70494  219.920462  18.314754
2009-06-05  19.139620  11.68559  221.938442  18.574835
2009-06-08  19.031134  11.87906  219.166213  18.499327
2009-06-09  18.881637  12.18862  217.592780  18.524497
2009-06-10  18.554861  12.51751  216.084284  18.918813
2009-06-11  18.515171  12.83674  214.286083  19.153726
2009-06-12  18.120921  12.95282  212.208155  19.573212
2009-06-15  18.004499  12.44980  208.177184  19.648719
2009-06-16  18.038896  12.35307  207.792570  19.673889
2009-06-17  17.937027  12.34339  207.372978  19.866852
2009-06-18  17.976716  12.19829  206.823530  19.715837
2009-06-19  18.452991  12.85609  209.835520  20.194051
2009-06-22  18.173842  12.55621  203.471879  19.531264
2009-06-23  17.729317  12.55621  202.637715  19.581602
2009-06-24  18.021697  12.84641  204.440904  19.690667
2009-06-25  18.503264  13.20433  207.677677  19.959140
2009-06-26  18.844594  13.23335  212.447917  19.589992
2009-06-29  18.782414  13.40748  211.858503  20.017868
2009-06-30  18.843271  13.28172  210.584781  19.942360
2009-07-01  18.896190  12.95282  209.286072  20.168883
2009-07-02  18.524432  12.54654  204.041310  19.606772
2009-07-06  18.337890  12.98184  204.600750  19.464146
...               ...       ...         ...        ...
2009-11-18  27.248193  15.53565  288.037456  25.515771
2009-11-19  26.527166  15.35185  286.209296  25.236123
2009-11-20  26.449110  13.82344  284.695781  25.100536
2009-11-23  27.237609  14.30711  290.884611  25.371710
2009-11-24  27.047100  13.85246  291.254246  25.346287
2009-11-25  27.014025  13.89115  292.577910  25.244598
2009-11-27  26.537750  13.67834  289.590906  24.761568
2009-11-30  26.447787  13.65899  291.209293  24.922578
2009-12-01  26.058829  13.38813  294.640874  25.431029
2009-12-02  25.960929  13.21401  293.462046  25.236123
2009-12-03  25.994003  13.02054  292.577910  25.278493
2009-12-04  25.575941  13.02054  292.213294  25.405606
2009-12-07  24.997796  12.85609  292.832667  25.244598
2009-12-08  25.119511  12.39176  293.232260  25.058164
2009-12-09  26.168637  12.68196  294.216280  25.176802
2009-12-10  25.987388  12.79805  295.455055  25.312391
2009-12-11  25.754543  12.69164  294.960537  25.295442
2009-12-14  26.060152  12.74871  297.567930  25.515771
2009-12-15  25.688394  13.06891  296.274225  25.439503
2009-12-16  25.802171  13.25270  298.581939  25.507297
2009-12-17  25.382784  13.29140  296.673849  25.083588
2009-12-18  25.855090  13.29140  297.912594  25.727626
2009-12-21  26.225525  13.64931  299.041480  25.863213
2009-12-22  26.507322  13.64931  300.260243  26.117438
2009-12-23  26.737522  13.87181  305.534978  26.202180
2009-12-24  27.655673  14.30711  308.931613  26.269973
2009-12-28  27.995679  14.12332  311.124419  26.414034
2009-12-29  27.663611  13.85246  309.391155  26.600466
2009-12-30  27.999648  14.30711  311.054464  26.236076
2009-12-31  27.879257  13.89115  309.680858  25.829315

[155 rows x 4 columns]

In [290]:
stacked = pdata.ix[:, '5/30/2009':, :].to_frame()
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2009-06-01 AAPL   136.469999  139.990000  136.000002  139.349998  113124900.0
           DELL    11.700000   12.250000   11.680000   12.180000   26080000.0
           GOOG   418.730711  429.600728  418.530715  426.560745    6669600.0
           MSFT    21.000000   21.500000   20.860001   21.400000   57317100.0
2009-06-02 AAPL   138.990004  141.340004  138.350002  139.490002  114055900.0
           DELL    12.160000   12.380000   11.840000   11.940000   20086400.0
           GOOG   426.250718  429.960746  423.400716  428.400749    5266800.0
           MSFT    21.360001   21.980000   21.200001   21.400000   48935700.0
2009-06-03 AAPL   140.000000  141.109999  139.070005  140.949995  141299900.0
           DELL    11.920000   12.020000   11.450000   11.620000   29954500.0
           GOOG   426.000731  432.460747  424.000735  431.650745    7092000.0
           MSFT    21.309999   21.760000   21.290001   21.730000   56039600.0
2009-06-04 AAPL   140.130003  144.180002  140.040001  143.740005  137658500.0
           DELL    11.590000   12.210000   11.560000   12.100000   24366400.0
           GOOG   435.300734  441.240742  434.500748  440.280765    7303300.0
           MSFT    21.770000   21.900000   21.580000   21.830000   42330000.0
2009-06-05 AAPL   145.310001  146.400000  143.209993  144.670000  158179000.0
           DELL    12.270000   12.320000   11.921500   12.080000   21110500.0
           GOOG   445.070755  447.340771  439.460746  444.320760    7389100.0
           MSFT    21.959999   22.309999   21.809999   22.139999   59579200.0
2009-06-08 AAPL   143.819994  144.230003  139.430000  143.849995  232913100.0
           DELL    11.880000   12.400000   11.760000   12.280000   25516400.0
           GOOG   439.500751  440.920759  434.120758  438.770759    6220500.0
           MSFT    21.980000   22.320000   21.629999   22.049999   49000600.0
2009-06-09 AAPL   143.809994  144.559998  140.549999  142.719995  169241100.0
           DELL    12.420000   12.790000   12.400000   12.600000   24070100.0
           GOOG   438.580749  440.500764  431.760745  435.620746    6534100.0
           MSFT    22.059999   22.320000   21.879999   22.080000   50887700.0
2009-06-10 AAPL   142.279999  142.350000  138.300001  140.250006  172155900.0
           DELL    12.790000   12.970000   12.490000   12.940000   30080700.0
...                      ...         ...         ...         ...          ...
2009-12-21 GOOG   597.611006  599.841017  595.671019  598.681044    5161600.0
           MSFT    30.400000   30.840000   30.370001   30.520000   40129100.0
2009-12-22 AAPL   199.439999  200.850004  198.659994  200.360006   87378900.0
           DELL    14.150000   14.320000   14.070000   14.110000   21519500.0
           GOOG   601.341005  601.501027  598.851051  601.121006    3775600.0
           MSFT    30.600000   30.930000   30.540001   30.820000   36321000.0
2009-12-23 AAPL   201.199999  202.379999  200.810003  202.100006   86381400.0
           DELL    14.110000   14.500000   14.070000   14.340000   17579700.0
           GOOG   603.501053  612.871081  602.851041  611.681027    4160800.0
           MSFT    30.709999   30.950001   30.690001   30.920000   28362700.0
2009-12-24 AAPL   203.549999  209.349998  203.349995  209.040005  125222300.0
           DELL    14.320000   14.800000   14.270000   14.790000   12874600.0
           GOOG   612.931058  619.521047  612.271061  618.481090    1723800.0
           MSFT    30.879999   31.000000   30.760000   31.000000   11083900.0
2009-12-28 AAPL   211.719999  213.949997  209.610004  211.609997  161141400.0
           DELL    14.810000   14.810000   14.440000   14.600000   14575400.0
           GOOG   621.661061  625.991080  618.481090  622.871087    3408400.0
           MSFT    31.000000   31.180000   30.889999   31.170000   25384000.0
2009-12-29 AAPL   212.629993  212.719995  208.729998  209.100006  111301400.0
           DELL    14.670000   14.670000   14.280000   14.320000   15132700.0
           GOOG   624.741049  624.841093  618.291049  619.401092    2860200.0
           MSFT    31.350000   31.500000   31.230000   31.389999   29716200.0
2009-12-30 AAPL   208.830000  212.000006  208.310001  211.639997  103021100.0
           DELL    14.290000   14.790000   14.250000   14.790000   20032900.0
           GOOG   618.501062  622.731037  618.011072  622.731037    2942100.0
           MSFT    31.150000   31.290001   30.799999   30.959999   42006200.0
2009-12-31 AAPL   213.130005  213.349997  210.559999  210.730003   88102700.0
           DELL    14.790000   14.800000   14.300000   14.360000   19014400.0
           GOOG   624.751096  625.401047  619.981079  619.981079    2448700.0
           MSFT    30.980000   30.990000   30.480000   30.480000   31929700.0

                   Adj Close
Date       minor
2009-06-01 AAPL    18.435792
           DELL    11.782330
           GOOG   213.067305
           MSFT    17.953996
2009-06-02 AAPL    18.454314
           DELL    11.550160
           GOOG   213.986388
           MSFT    17.953996
2009-06-03 AAPL    18.647469
           DELL    11.240610
           GOOG   215.609763
           MSFT    18.230857
2009-06-04 AAPL    19.016583
           DELL    11.704940
           GOOG   219.920462
           MSFT    18.314754
2009-06-05 AAPL    19.139620
           DELL    11.685590
           GOOG   221.938442
           MSFT    18.574835
2009-06-08 AAPL    19.031134
           DELL    11.879060
           GOOG   219.166213
           MSFT    18.499327
2009-06-09 AAPL    18.881637
           DELL    12.188620
           GOOG   217.592780
           MSFT    18.524497
2009-06-10 AAPL    18.554861
           DELL    12.517510
...                      ...
2009-12-21 GOOG   299.041480
           MSFT    25.863213
2009-12-22 AAPL    26.507322
           DELL    13.649310
           GOOG   300.260243
           MSFT    26.117438
2009-12-23 AAPL    26.737522
           DELL    13.871810
           GOOG   305.534978
           MSFT    26.202180
2009-12-24 AAPL    27.655673
           DELL    14.307110
           GOOG   308.931613
           MSFT    26.269973
2009-12-28 AAPL    27.995679
           DELL    14.123320
           GOOG   311.124419
           MSFT    26.414034
2009-12-29 AAPL    27.663611
           DELL    13.852460
           GOOG   309.391155
           MSFT    26.600466
2009-12-30 AAPL    27.999648
           DELL    14.307110
           GOOG   311.054464
           MSFT    26.236076
2009-12-31 AAPL    27.879257
           DELL    13.891150
           GOOG   309.680858
           MSFT    25.829315

[600 rows x 6 columns]

In [291]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 150 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2009-06-01 00:00:00 to 2009-12-31 00:00:00
Minor_axis axis: AAPL to MSFT